renesas/ArduinoCore-rl78/cores/rl78g23/wiring_analog.c
/*
 wiring_analog.c - analog input and output
 Part of Arduino - http://www.arduino.cc/

 Copyright (c) 2005-2006 David A. Mellis

 This library is free software; you can redistribute it and/or
 modify it under the terms of the GNU Lesser General Public
 License as published by the Free Software Foundation; either
 version 2.1 of the License, or (at your option) any later version.

 This library is distributed in the hope that it will be useful,
 but WITHOUT ANY WARRANTY; without even the implied warranty of
 MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU
 Lesser General Public License for more details.

 You should have received a copy of the GNU Lesser General
 Public License along with this library; if not, write to the
 Free Software Foundation, Inc., 59 Temple Place, Suite 330,
 Boston, MA  02111-1307  USA

 Modified 28 September 2010 by Mark Sproul

 $Id: wiring.c 248 2007-02-03 15:36:30Z mellis $
 */
/*
 * Modified  4 Mar  2017 by Yuuki Okamiya for RL78/G13
 */
#include "wiring_private.h"
#include "pins_arduino.h"

#ifdef __RL78__
#include "pintable.h"
#include "r_smc_entry.h"

extern uint8_t g_adc_int_flg;
static uint8_t g_u8AnalogReference = DEFAULT;
static uint8_t g_u8SwPwmTicksCount = 0;
uint8_t g_u8ADUL = 0xFF;
uint8_t g_u8ADLL = 0x00;
boolean g_bAdcInterruptFlag = false;

/* 1027 Nhu add */
extern uint32_t R_BSP_GetFclkFreqHz(void);
/* 1027 Nhu add */

/* 1008 Mitsugi add */
/* Match to the value of PWM_PIN */
volatile unsigned short *g_timer_period_reg[PWM_CH_NUM] = {&TDR00,&TDR02,&TDR04,&TDR06};
volatile unsigned short *g_timer_duty_reg[PWM_CH_NUM]   = {&TDR01,&TDR03,&TDR05,&TDR07};
volatile unsigned short *g_timer_analog_mode_reg[PWM_CH_NUM] = {&TMR01,&TMR03,&TMR05,&TMR07};
volatile unsigned short *g_timer_analog_clock_select_reg = &TPS0;
const uint8_t  pwm_channel_table[PWM_CH_NUM]  = {PWM_PIN_32,PWM_PIN_6,PWM_PIN_10,PWM_PIN_5};

static void _analogPinRead(uint8_t pin);
static int _analogRead(uint8_t u8ADS);
static int _analogDuty(int val, uint16_t frequency);
static uint16_t _analogFrequency (uint8_t pin, uint32_t u32Hz);

Pwm_func pwm_ch[PWM_CH_NUM] =
{
	{
		.open  = (void*)R_Config_TAU0_01_PWM_Create,
		.start = (void*)R_Config_TAU0_01_PWM_Start,
		.cycle = CYCLE_VALUE,
	},
	{
		.open  = (void*)R_Config_TAU0_23_PWM_Create,
		.start = (void*)R_Config_TAU0_23_PWM_Start,
		.cycle = CYCLE_VALUE,
	},
	{
		.open  = (void*)R_Config_TAU0_45_PWM_Create,
		.start = (void*)R_Config_TAU0_45_PWM_Start,
		.cycle = CYCLE_VALUE,
	},
	{
		.open  = (void*)R_Config_TAU0_67_PWM_Create,
		.start = (void*)R_Config_TAU0_67_PWM_Start,
		.cycle = CYCLE_VALUE,
	}
};

int8_t get_pwm_channel(uint8_t pwm_num)
{
	uint8_t pwm_cnt;

	for(pwm_cnt=0;pwm_cnt<PWM_CH_NUM;pwm_cnt++)
	{
		if (pwm_num == pwm_channel_table[pwm_cnt])
		{
			return pwm_cnt;
		}
	}
	return -1;
}
/* 1008 Mitsugi add */

#endif /*__RL78__*/

/* 1006 Nhu add */
/***********************************************************************************************************************
* Function Name: analogReference
* Description  : The reference voltage used for analog input.
* Arguments    : mode -
*                    DEFAULT: use VDD as VREF(+)
*                    INTERNAL: use internal voltage as VREF(+)
*                    EXTERNAL: use AVREFP as VREF(+)
* Return Value : None
***********************************************************************************************************************/
void analogReference(uint8_t mode) 
{
	// can't actually set the register here because the default setting
	// will connect AVCC and the AREF pin, which would cause a short if
	// there's something connected to AREF.
#ifndef __RL78__
	analog_reference = mode;
#else
	R_Config_ADC_Create();
	R_Config_ADC_Set_Reference(mode);
	g_u8AnalogReference = mode;
#endif
}
/* 1006 Nhu add */

#ifdef __RL78__

bool g_u8AnalogWriteAvailableTable[NUM_DIGITAL_PINS] = {
false, false, false, false,
false, false, false, false,
false, false, false, false,
false, false, false, false,
false, false, false, false,
false, false, false, false,
false, };
const uint8_t g_au8AnalogPinTable[NUM_ANALOG_INPUTS] = {
ANALOG_PIN_0, ANALOG_PIN_1, ANALOG_PIN_2, ANALOG_PIN_3,
ANALOG_PIN_4, ANALOG_PIN_5, ANALOG_PIN_6, ANALOG_PIN_7,
ANALOG_PIN_8, ANALOG_PIN_9};

volatile SwPwm g_SwPwm[NUM_SWPWM_PINS] = { { 0, 0, 0, 0, 0, 0 }, };

bool g_u8AnalogReadAvailableTable[NUM_ANALOG_INPUTS] = { 0 };

const uint8_t g_analog_pin_input[NUM_ANALOG_INPUTS] = {A0, A1, A2, A3, A4, A5, A6, A7, A8, A9};
int8_t get_analog_channel(uint8_t analog_num)
{
	uint8_t analog_cnt;

	for(analog_cnt=0;analog_cnt<NUM_ANALOG_INPUTS;analog_cnt++)
	{
		if (analog_num == g_analog_pin_input[analog_cnt])
		{
			return analog_cnt;
		}
	}
	return -1;
}

#endif/*__RL78__*/

/***********************************************************************************************************************
* Function Name: analogRead
* Description  : Reads the value from the specified analog pin.
* Arguments    : analog_pin - the name of the analog input pin to read from A0 to A7
* Return Value : The analog reading on the pin.
*                Although it is limited to the resolution of the analog to digital converter
*                (0-255 for 8 bits or 0-1023 for 10 bits).
***********************************************************************************************************************/
int analogRead(uint8_t analog_pin) {
#if 0
#ifndef __RL78__
	uint8_t low, high;

#if defined(analogPinToChannel)
#if defined(__AVR_ATmega32U4__)
	if (pin >= 18) pin -= 18; // allow for channel or pin numbers
#endif
	pin = analogPinToChannel(pin);
#elif defined(__AVR_ATmega1280__) || defined(__AVR_ATmega2560__)
	if (pin >= 54) pin -= 54; // allow for channel or pin numbers
#elif defined(__AVR_ATmega32U4__)
	if (pin >= 18) pin -= 18; // allow for channel or pin numbers
#elif defined(__AVR_ATmega1284__) || defined(__AVR_ATmega1284P__) || defined(__AVR_ATmega644__) || defined(__AVR_ATmega644A__) || defined(__AVR_ATmega644P__) || defined(__AVR_ATmega644PA__)
	if (pin >= 24) pin -= 24; // allow for channel or pin numbers
#else
	if (pin >= 14) pin -= 14; // allow for channel or pin numbers
#endif

#if defined(ADCSRB) && defined(MUX5)
	// the MUX5 bit of ADCSRB selects whether we're reading from channels
	// 0 to 7 (MUX5 low) or 8 to 15 (MUX5 high).
	ADCSRB = (ADCSRB & ~(1 << MUX5)) | (((pin >> 3) & 0x01) << MUX5);
#endif

