renesas/ArduinoCore-rl78/cores/rl78g23/wiring_analog.c
	// set the analog reference (high two bits of ADMUX) and select the
	// channel (low 4 bits).  this also sets ADLAR (left-adjust result)
	// to 0 (the default).
#if defined(ADMUX)
	ADMUX = (analog_reference << 6) | (pin & 0x07);
#endif

	// without a delay, we seem to read from the wrong channel
	//delay(1);

#if defined(ADCSRA) && defined(ADCL)
	// start the conversion
	sbi(ADCSRA, ADSC);

	// ADSC is cleared when the conversion finishes
	while (bit_is_set(ADCSRA, ADSC));

	// we have to read ADCL first; doing so locks both ADCL
	// and ADCH until ADCH is read.  reading ADCL second would
	// cause the results of each conversion to be discarded,
	// as ADCL and ADCH would be locked when it completed.
	low = ADCL;
	high = ADCH;
#else
	// we dont have an ADC, return 0
	low = 0;
	high = 0;
#endif

	// combine the two bytes
	return (high << 8) | low;
#else /*__RL78__*/
	int s16Result = 0;
	uint8_t oldadpc, newadpc;
	// ピン番号がANALOG_PIN_START_NUMBER（GR-KURUMIの場合は14）以上の場合0～に割り当てなおす。
	if (pin >= ANALOG_PIN_START_NUMBER) {
		pin -= ANALOG_PIN_START_NUMBER;
	}

	if (pin < NUM_ANALOG_INPUTS) {
		if (g_u8AnalogReadAvailableTable[pin] == false) {
			// ピンモードをAnalogモードに変更
//			PinTableType* p = &PinTable[pin];
			PinTableType* p;
			getPinTable(pin,p);
			if (0!=p->pmca)
			{
				/* アナログピンの場合PMCAをセットする */
				*p->portModeControlARegisterAddr &= (unsigned long)~(p->pmca);
			}
#if 0
			switch (g_au8AnalogPinTable[pin]) {
			case 18:
				PMCA14 |= 0x80;	// P147をアナログポートに設定
				break;

			case 19:
				PMCA12 |= 0x01;	// P120をアナログポートに設定
				break;

			default:
//				oldadpc = ADPC;
//				newadpc = (pin - 14) + ANALOG_ADPC_OFFSET - 1;
//				if (newadpc > oldadpc) {
//					ADPC = newadpc;
//				}
				break;
			}
#endif
			// Specify pin number as digital port number
			pinMode(pin + ANALOG_PIN_START_NUMBER, INPUT);
			g_u8AnalogReadAvailableTable[pin] = true;

		}

	}

	// アナログ値の読み込み
	s16Result = _analogRead(g_au8AnalogPinTable[pin]);
//	s16Result = _analogRead(pin);
	return s16Result;
#endif/*__RL78__*/
#endif/* if 0 */

	int s16Result = 0;
	uint8_t analog_read_flg = 0;
	uint8_t cnt;

	//アナログ入力端子の設定
	_analogPinRead(analog_pin);

	//アナログ入力端子ではない場合、何もしない終了する
	for(cnt = 0; cnt < NUM_ANALOG_INPUTS; cnt ++)
	{
		if(analog_pin == g_analog_pin_input[cnt])
		{
			analog_read_flg = 1;
			cnt = NUM_ANALOG_INPUTS;
		}
		else
		{
		analog_read_flg = 0;
		}
	}

	if(analog_read_flg == 1)
	{
	// アナログ値の読み込み
	s16Result = _analogRead(g_au8AnalogPinTable[get_analog_channel(analog_pin)]);
	}
	return s16Result;
}

// Right now, PWM output only works on the pins with
// hardware support.  These are defined in the appropriate
// pins_*.c file.  For the rest of the pins, we default
// to digital output.
/***********************************************************************************************************************
* Function Name: analogWrite
* Description  : Writes an analog value (PWM wave) to a pin.
* Arguments    : pin - the name of output pin (5,6,10,32)
*                value - Output PWM duty 0 ~ 255
* Return Value : None
***********************************************************************************************************************/
void analogWrite(uint8_t pin, int value) {
#ifndef __RL78__
	// We need to make sure the PWM output is enabled for those pins
	// that support it, as we turn it off when digitally reading or
	// writing with them.  Also, make sure the pin is in output mode
	// for consistenty with Wiring, which doesn't require a pinMode
	// call for the analog output pins.
	pinMode(pin, OUTPUT);
	if (val == 0)
	{
		digitalWrite(pin, LOW);
	}
	else if (val == 255)
	{
		digitalWrite(pin, HIGH);
	}
	else
	{
		switch(digitalPinToTimer(pin))
		{
			// XXX fix needed for atmega8
#if defined(TCCR0) && defined(COM00) && !defined(__AVR_ATmega8__)
			case TIMER0A:
			// connect pwm to pin on timer 0
			sbi(TCCR0, COM00);
			OCR0 = val;// set pwm duty
			break;
#endif

#if defined(TCCR0A) && defined(COM0A1)
			case TIMER0A:
			// connect pwm to pin on timer 0, channel A
			sbi(TCCR0A, COM0A1);
			OCR0A = val;// set pwm duty
			break;
#endif

#if defined(TCCR0A) && defined(COM0B1)
			case TIMER0B:
			// connect pwm to pin on timer 0, channel B
			sbi(TCCR0A, COM0B1);
			OCR0B = val;// set pwm duty
			break;
#endif

#if defined(TCCR1A) && defined(COM1A1)
			case TIMER1A:
			// connect pwm to pin on timer 1, channel A
			sbi(TCCR1A, COM1A1);
			OCR1A = val;// set pwm duty
			break;
#endif

#if defined(TCCR1A) && defined(COM1B1)
			case TIMER1B:
			// connect pwm to pin on timer 1, channel B
			sbi(TCCR1A, COM1B1);
			OCR1B = val;// set pwm duty
			break;
#endif

#if defined(TCCR2) && defined(COM21)
			case TIMER2:
			// connect pwm to pin on timer 2
			sbi(TCCR2, COM21);
			OCR2 = val;// set pwm duty
			break;
#endif

#if defined(TCCR2A) && defined(COM2A1)
			case TIMER2A:
			// connect pwm to pin on timer 2, channel A
			sbi(TCCR2A, COM2A1);
			OCR2A = val;// set pwm duty
			break;
#endif

#if defined(TCCR2A) && defined(COM2B1)
			case TIMER2B:
			// connect pwm to pin on timer 2, channel B
			sbi(TCCR2A, COM2B1);
			OCR2B = val;// set pwm duty
			break;
#endif

#if defined(TCCR3A) && defined(COM3A1)
			case TIMER3A:
			// connect pwm to pin on timer 3, channel A
			sbi(TCCR3A, COM3A1);
			OCR3A = val;// set pwm duty
			break;
#endif

#if defined(TCCR3A) && defined(COM3B1)
			case TIMER3B:
			// connect pwm to pin on timer 3, channel B
			sbi(TCCR3A, COM3B1);
			OCR3B = val;// set pwm duty
			break;
#endif

#if defined(TCCR3A) && defined(COM3C1)
			case TIMER3C:
			// connect pwm to pin on timer 3, channel C
			sbi(TCCR3A, COM3C1);
			OCR3C = val;// set pwm duty
			break;
#endif

#if defined(TCCR4A)
			case TIMER4A:
			//connect pwm to pin on timer 4, channel A
			sbi(TCCR4A, COM4A1);
#if defined(COM4A0)		// only used on 32U4
			cbi(TCCR4A, COM4A0);
#endif
			OCR4A = val;	// set pwm duty
			break;
#endif

#if defined(TCCR4A) && defined(COM4B1)
			case TIMER4B:
			// connect pwm to pin on timer 4, channel B
			sbi(TCCR4A, COM4B1);
			OCR4B = val;// set pwm duty
			break;
#endif

