renesas/ArduinoCore-rl78/cores/rl78g23/wiring_analog.c
#if defined(TCCR4A) && defined(COM4C1)
			case TIMER4C:
			// connect pwm to pin on timer 4, channel C
			sbi(TCCR4A, COM4C1);
			OCR4C = val;// set pwm duty
			break;
#endif

#if defined(TCCR4C) && defined(COM4D1)
			case TIMER4D:
			// connect pwm to pin on timer 4, channel D
			sbi(TCCR4C, COM4D1);
#if defined(COM4D0)		// only used on 32U4
			cbi(TCCR4C, COM4D0);
#endif
			OCR4D = val;	// set pwm duty
			break;
#endif

#if defined(TCCR5A) && defined(COM5A1)
			case TIMER5A:
			// connect pwm to pin on timer 5, channel A
			sbi(TCCR5A, COM5A1);
			OCR5A = val;// set pwm duty
			break;
#endif

#if defined(TCCR5A) && defined(COM5B1)
			case TIMER5B:
			// connect pwm to pin on timer 5, channel B
			sbi(TCCR5A, COM5B1);
			OCR5B = val;// set pwm duty
			break;
#endif

#if defined(TCCR5A) && defined(COM5C1)
			case TIMER5C:
			// connect pwm to pin on timer 5, channel C
			sbi(TCCR5A, COM5C1);
			OCR5C = val;// set pwm duty
			break;
#endif

			case NOT_ON_TIMER:
			default:
			if (val < 128) {
				digitalWrite(pin, LOW);
			} else {
				digitalWrite(pin, HIGH);
			}
		}
	}
#else /*__RL78__*/
//	uint8_t u8Timer;
	if (pin < NUM_DIGITAL_PINS) {
		{
			value = min(max(value, PWM_MIN), PWM_MAX);
#if !defined(G23_FPB)
			u8Timer = getPinTable(pin)->timer;
			if (u8Timer == SWPWM_PIN) {
				/////////////////////
				 Software PWM対応ピンの場合
				/////////////////////
#if defined(__RL78__)
				_startTAU0(TIMER_CLOCK);
				if (!g_u8AnalogWriteAvailableTable[pin]) {
					pinMode(pin, OUTPUT);		// 初期時のみ出力モードを設定
					g_u8AnalogWriteAvailableTable[pin] = true;
				}
				int i;
				int j = NUM_SWPWM_PINS;
				for (i = 0; i < NUM_SWPWM_PINS; i++) {
					if (!g_SwPwm[i].valid) {
						if (j >= NUM_SWPWM_PINS) {
							j = i;
						}
					} else if (g_SwPwm[i].pin == pin) {
						break;
					}
				}
				if (i >= NUM_SWPWM_PINS) {
					i = j;
				}
				if (i < NUM_SWPWM_PINS) {
					if (g_SwPwm[i].valid && g_SwPwm[i].pin == pin) {
						g_SwPwm[i].newValue = val;
					} else {
//						const PinTableType* p = getPinTable(pin);
						PinTableType* p;
						getPinTable(pin,p);
						g_SwPwm[i].valid = false;
						g_SwPwm[i].pin = pin;
						g_SwPwm[i].value = g_SwPwm[i].newValue = val;
						g_SwPwm[i].port = p->portRegisterAddr;
						g_SwPwm[i].mask = p->mask;
						g_SwPwm[i].valid = true;
					}
					if (!(TE0 & 0x0040)) { // No pin uses Software PWM
						_startTimerChannel( SW_PWM_TIMER, 0x0001, SWPWM_MIN,
								false, true);
					}
				} else {
					digitalWrite(pin,
							val >= ((PWM_MIN + PWM_MAX + 1) / 2) ? HIGH : LOW);
				}

#endif
			} else {
				///////////////////////
				// PWM対応ピンの場合
				///////////////////////
				_startTAU0(TIMER_CLOCK);

				if (((TE0 & 0x0001) == 0) || (TDR00 != g_u16TDR00)) {
					// Masterチャネルの設定
					TT0 |= 0x0001;			// タイマ停止
					TMR00 = PWM_MASTER_MODE;	// 動作モードの設定
					TDR00 = g_u16TDR00;		// PWM出力の周期の設定
					TO0 &= ~0x0001;			// タイマ出力の設定
					TOE0 &= ~0x0001;			// タイマ出力許可の設定
					// マスタチャネルのタイマ動作許可
					TS0 |= 0x00001;
				}

				u16Duty = (unsigned short) (((unsigned long) val
						* (g_u16TDR00 + 1)) / PWM_MAX);
				if (!g_u8AnalogWriteAvailableTable[pin]) {
					pinMode(pin, OUTPUT);			// 出力モードに設定
					digitalWrite(pin, LOW);

					// Slaveチャネルの設定
					_startTimerChannel(u8Timer, PWM_SLAVE_MODE, u16Duty, true,
							false);
					g_u8AnalogWriteAvailableTable[pin] = true;

				} else {
					_modifyTimerPeriodic(u8Timer, u16Duty);
				}
			}
		}
	}
#endif
/* 1006 Nhu add */
			/* 1008 Mitsugi add */
			uint8_t cnt;
			uint8_t analog_write_flg = 0;
			int8_t pwm_channel = get_pwm_channel(pin);

			if (-1 ==(*(int8_t*)get_pwm_channel))
			{
				NOP();
			}

			/* If it is not a PWM output terminal, do nothing and exit */
			for(cnt = 0; cnt < PWM_CH_NUM; cnt ++)
			{
				if(pin == pwm_channel_table[cnt])
				{
					analog_write_flg = 1;
					cnt = PWM_CH_NUM;
				}
				else
				{
				analog_write_flg = 0;
				}
			}

			if(analog_write_flg == 1)
			{
			pwm_ch[pwm_channel].open();

			/* Frequency Set */
			if(pwm_ch[pwm_channel].cycle == CYCLE_VALUE)
			{
				pwm_ch[pwm_channel].cycle = _analogFrequency(pin,FREQUENCY_MIN_VAL);
			}
			else
			{
				*((uint32_t*)g_timer_period_reg[pwm_channel]) = pwm_ch[pwm_channel].cycle;
			}


			/* Duty set */
			*((uint32_t*)g_timer_duty_reg[pwm_channel])   = _analogDuty(value, pwm_ch[pwm_channel].cycle);

			pwm_ch[pwm_channel].start();
			}
			/* 1008 Mitsugi add */
		}
	}

#endif/*__RL78__*/

}

/***********************************************************************************************************************
* Function Name: analogWriteFrequency
* Description  : Sets the cycle. The default is 490Hz.
* Arguments    : Hz: cycle
* Return Value : None
***********************************************************************************************************************/
#ifdef __RL78__
void analogWriteFrequency(uint32_t Hz) {
	/* PWM output pulse cycle setting
	Pulse period = (TDR00 setting value + 1) x count clock period
	Example) When the pulse period is 2 [ms]
	2 [ms] = 1/32 [MHz] x (TDR00 setting + 1)
	TDR00 setting value = 63999 */

	pwm_ch[0].cycle = _analogFrequency(PWM_PIN_32,Hz);
	pwm_ch[1].cycle = _analogFrequency(PWM_PIN_6,Hz);
	pwm_ch[2].cycle = _analogFrequency(PWM_PIN_10,Hz);
	pwm_ch[3].cycle = _analogFrequency(PWM_PIN_5,Hz);

	/* 1008 Mitsugi add */
}

/***********************************************************************************************************************
* Function Name: analogWritePinFrequency
* Description  : Sets the cycle. The default is 490Hz.
* Arguments    : pin - the name of analog value (PWM wave) output pin (5,6,10,32)
*                Hz - cycle
* Return Value : None
***********************************************************************************************************************/
/* 1011 Nhu add */
void analogWritePinFrequency(uint8_t pin, uint32_t Hz) {
	/* PWM output pulse cycle setting
	Pulse period = (TDR00 setting value + 1) x count clock period
	Example) When the pulse period is 2 [ms]
	2 [ms] = 1/32 [MHz] x (TDR00 setting + 1)
	TDR00 setting value = 63999 */
	int8_t pwm_channel = get_pwm_channel(pin);
	pwm_ch[pwm_channel].cycle = _analogFrequency(pin, Hz);
}

