renesas/ArduinoCore-rl78/cores/rl78g23/wiring_analog.c
static uint16_t _analogFrequency (uint8_t pin, uint32_t u32Hz)
{
	uint16_t Result;
	uint32_t fclk_frequency = 0;
	uint32_t timer_frequency = 0;
	uint32_t timer_clock_mode = 0;
	uint32_t operating_clock_select = 0;
	int8_t pwm_channel = get_pwm_channel(pin);

	fclk_frequency = R_BSP_GetFclkFreqHz();

	/* Get timer frequency */
		timer_clock_mode = *((uint32_t*)g_timer_analog_mode_reg[pwm_channel]) & TAU_OPERATION_CLOCK;

		if (timer_clock_mode == _4000_TAU_CLOCK_SELECT_CKM2) /* CK02 Clock Selected */
		{
			operating_clock_select = *((uint32_t*)g_timer_analog_clock_select_reg) & CK02_OPERATION;
			if(operating_clock_select == _0000_TAU_CKM2_FCLK_1)
			{
				timer_frequency = fclk_frequency/2;	/*  fclk/2 */
			}
			else
			{
				operating_clock_select = operating_clock_select >> 8;
				timer_frequency = fclk_frequency/( pow(2, 2 * operating_clock_select));	/*  fclk/2^2 ~ 2^6 */
			}
		}
		else if  (timer_clock_mode == _C000_TAU_CLOCK_SELECT_CKM3) /* CK03 Clock Selected */
		{
			operating_clock_select = *((uint32_t*)g_timer_analog_clock_select_reg) & CK03_OPERATION;

			operating_clock_select = operating_clock_select >> 12;
			timer_frequency = fclk_frequency/( pow(2,(2 * operating_clock_select +8)));	/* fclk/2^8 ~ 2^14 */
		}
		else /* CK00, CK01 Clock Selected */
		{
			operating_clock_select = *((uint32_t*)g_timer_analog_clock_select_reg) & CK00_CK01_OPERATION;
			timer_frequency = fclk_frequency/( pow(2,operating_clock_select));	/* ckm00, ckm01 - fclk/2^0 ~ 2^15 */
		}

	/* 490 Hz <= frequency <= 8MHz */
	u32Hz = min(max(u32Hz, FREQUENCY_MIN_VAL), FREQUENCY_MAX_VAL);

	/* Pulse period = {Set value of TDRmn (master) + 1} × Count clock period
	   Set value of TDRmn (master) = (Pulse period / Count clock period) - 1 */
	Result = (timer_frequency / u32Hz) - 1;

	return Result;
}

static int _analogDuty(int val, uint16_t frequency)
{
/*	Duty factor [0 ~ 255] = {Set value of TDRmp (slave)}/{Set value of TDRmn (master) + 1} × 255
	{Set value of TDRmp (slave)} = Duty factor * {Set value of TDRmn (master) + 1} / 255 */

	unsigned short u16Duty = 0;

	/* Duty set */
	if(val> PWM_MAX)
	{
		val = PWM_MAX;
	}
	else
	{
		u16Duty = (unsigned short) (((unsigned long) val
				* (frequency + 1)) / PWM_MAX);
	}

	return u16Duty;
}

/* 1011 Nhu add */
static void _analogPinRead (uint8_t pin)
		{
	if (g_u8AnalogReadAvailableTable[pin] == false) {
		// ピンモードをAnalogモードに変更
		PinTableType *p;
		PinTableType pin_tbl;
		p = (PinTableType*)&pin_tbl;

		getPinTable(pin,p);
		if (0!=p->pmca)
		{
			pinMode(pin, INPUT);
			/* アナログピンの場合PMCAをセットする */
			*p->portModeControlARegisterAddr |= (unsigned long)(p->pmca);

//			*p->portModeControlARegisterAddr &= (unsigned long)~(p->pmca);
			g_u8AnalogReadAvailableTable[pin] = true;
		}
	}

	if (pin==29)
	{
		pin = 8;
	}
	else if (pin==40)
	{
		pin = 9;
	}
	else if (pin<ANALOG_PIN_START_NUMBER && pin < 2)
	{
		pin += 6;
	}
	else
	{
		pin -= ANALOG_PIN_START_NUMBER;
	}
		}

static int _analogRead(uint8_t u8ADS) {
	int s16Result = 0;
#if !defined(G23_FPB)
	if (((0 <= u8ADS) && (u8ADS <= 14)) || ((16 <= u8ADS) && (u8ADS <= 26))) {
#ifdef WORKAROUND_READ_MODIFY_WRITE
		ADM0 = 0x00;		// A/Dコンバータの動作停止、fclk/64、ノーマル1モードに設定
		CBI(SFR_IF1H, 0);		// INTADの割り込みフラグのクリア
#else /* WORKAROUND_READ_MODIFY_WRITE */
		ADCEN = 1;			// A/Dコンバータにクロック供給開始
		NOP();
		NOP();
		NOP();
		NOP();
		ADM0 = 0x00;// A/Dコンバータの動作停止、fclk/64、ノーマル1モードに設定
		ADMK = 1;// INTADの割り込み禁止
		ADIF = 0;// INTADの割り込みフラグのクリア
		ADPR1 = 1;// INTADの割り込み優先順位の設定
		ADPR0 = 1;// INTADの割り込み優先順位の設定
#endif
		if (g_u8AnalogReference == DEFAULT) {
			ADM2 = 0x00;	// Vddリファレンスに設定
		} else if (g_u8AnalogReference == INTERNAL) {
			ADM2 = 0x80;	// 内部リファレンス(1.45V)に設定
		} else { // EXTERNAL
			ADM2 = 0x40;	// 外部リファレンスに設定
		}
		if (g_u8PowerManagementMode == PM_SNOOZE_MODE) {
			ADM1 = 0xE3;	// ハードウェア・トリガ(INTIT)・ウェイト･モード、ワンショットに設定
		} else {
			ADM1 = 0x20;	// ソフトウェア・トリガ・モード、ワンショットに設定
		}
		ADUL = g_u8ADUL;
		ADLL = g_u8ADLL;
		ADS = u8ADS;		// アナログチャンネルの設定
		delayMicroseconds(5);	// 5 us 待ち
#ifdef WORKAROUND_READ_MODIFY_WRITE
		SBI(SFR_ADM0, SFR_BIT_ADCE);	// A/Dコンパレータを有効に設定
#else /* WORKAROUND_READ_MODIFY_WRITE */
				ADCE = 1;			// A/Dコンパレータを有効に設定
#endif
		if (g_u8PowerManagementMode == PM_SNOOZE_MODE) {
#ifdef WORKAROUND_READ_MODIFY_WRITE
			CBI(SFR_MK1H, 0);	// INTADの割り込み許可
			ADM2 |= 0x04;	// SNOOZEモードの設定
#else /* WORKAROUND_READ_MODIFY_WRITE */
					ADMK = 0;			// INTADの割り込み許可
					ADM2 |= 0x04;// SNOOZEモードの設定
#endif
			while (g_bAdcInterruptFlag == false) {
				enterPowerManagementMode(0xFFFFFFFF);	// A/Dコンバート待ち
			}
			ADM2 &= ~0x04;	// SNOOZEモードの設定解除
			g_bAdcInterruptFlag = false;
//			SBI(MK1H, 0);		// INTADの割り込み禁止
			ADMK = 1U;
		} else {
			delayMicroseconds(1);	// 1 us 待ち
#ifdef WORKAROUND_READ_MODIFY_WRITE
			SBI(SFR_ADM0, SFR_BIT_ADCS);	// A/Dコンバータの開始
#else /* WORKAROUND_READ_MODIFY_WRITE */
					ADCS = 1;		// A/Dコンバータの開始
#endif
			while (ADIF == 0)
				;	// A/Dコンバート待ち
		}
		s16Result = (ADCR >> 6);	// A/Dコンバート結果の取得

#ifdef WORKAROUND_READ_MODIFY_WRITE
		CBI(SFR_IF1H, 0);		// INTADの割り込みフラグのクリア
		CBI(SFR_ADM0, SFR_BIT_ADCE);		// A/Dコンパレータを無効に設定
#else /* WORKAROUND_READ_MODIFY_WRITE */
				ADMK = 1;			// INTADの割り込み禁止
				ADIF = 0;// INTADの割り込みフラグのクリア
				ADCE = 0;// A/Dコンパレータを無効に設定
				ADCEN = 0;// A/Dコンバータのクロック供給停止
#endif
	}
#endif

	/* 1006 Nhu add */
	R_Config_ADC_Set_ADChannel(u8ADS);
	R_Config_ADC_Set_OperationOn();
	g_adc_int_flg=0;
	R_Config_ADC_Start();
	while(0==g_adc_int_flg)
	{
		NOP();
	}
	if(g_u8AnalogReference == INTERNAL)
	{
		R_Config_ADC_Get_Result_8bit((uint8_t*)&s16Result);
	}
	else
	{
		R_Config_ADC_Get_Result_10bit((uint16_t*)&s16Result);
	}
	R_Config_ADC_Set_OperationOff();
	R_Config_ADC_Start();

	return s16Result;
}


/**
 * SoftwarePWMの次回割り込みタイミングの設定処理
 *
 * @return なし
 *
 * @attention なし
 ***************************************************************************/
#if !defined(G23_FPB)
void _softwarePWM(void) {
	SwPwm* p;
	for (p = (SwPwm*) &g_SwPwm[0]; p < (SwPwm*) &g_SwPwm[NUM_SWPWM_PINS]; p++) {
		if (p->valid) {
			if (g_u8SwPwmTicksCount == PWM_MIN) {
				p->value = p->newValue;
			}
			if (g_u8SwPwmTicksCount == p->value) {
				*p->port &= ~p->mask;	// 出力をLOWに設定
			} else if (g_u8SwPwmTicksCount == PWM_MIN) {
				*p->port |= p->mask;	// 出力をHIGHに設定
			}
		}
	}
	if (++g_u8SwPwmTicksCount >= PWM_MAX) {
		g_u8SwPwmTicksCount = PWM_MIN;
	};
}

INTERRUPT void adc_interrupt(void) {
	g_bAdcInterruptFlag = true;
}

INTERRUPT void tm06_interrupt(void) {
	_softwarePWM();
}
#endif
#endif/*__RL78__*/
